In [1]:
#import the data 
import pandas as pd
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#Load the data
df = pd.read_excel('C:/Users/Samuel Kim/Downloads/HospitalCosts.xlsx' )
print(df)

     AGE  FEMALE  LOS  RACE  TOTCHG  APRDRG
0     17       1    2   1.0    2660     560
1     17       0    2   1.0    1689     753
2     17       1    7   1.0   20060     930
3     17       1    1   1.0     736     758
4     17       1    1   1.0    1194     754
..   ...     ...  ...   ...     ...     ...
495    0       1    6   1.0    5881     636
496    0       1    2   1.0    1171     640
497    0       1    2   1.0    1171     640
498    0       1    2   1.0    1086     640
499    0       0    4   1.0    4931     640

[500 rows x 6 columns]

In [3]:
# head() function to see the first five
df.head()

   AGE  FEMALE  LOS  RACE  TOTCHG  APRDRG
0   17       1    2   1.0    2660     560
1   17       0    2   1.0    1689     753
2   17       1    7   1.0   20060     930
3   17       1    1   1.0     736     758
4   17       1    1   1.0    1194     754

In [4]:
#renaming the column female
df = df.rename(columns={'FEMALE':'GENDER'})
print(df)

     AGE  GENDER  LOS  RACE  TOTCHG  APRDRG
0     17       1    2   1.0    2660     560
1     17       0    2   1.0    1689     753
2     17       1    7   1.0   20060     930
3     17       1    1   1.0     736     758
4     17       1    1   1.0    1194     754
..   ...     ...  ...   ...     ...     ...
495    0       1    6   1.0    5881     636
496    0       1    2   1.0    1171     640
497    0       1    2   1.0    1171     640
498    0       1    2   1.0    1086     640
499    0       0    4   1.0    4931     640

[500 rows x 6 columns]

In [5]:
# turning my female column into a dummy 0- male 1-female
dummy = pd.get_dummies(df['GENDER'])
dummy.head()

   0  1
0  0  1
1  1  0
2  0  1
3  0  1
4  0  1

In [6]:
#conc
df = pd.concat([df, dummy], axis=1)
print(df)

     AGE  GENDER  LOS  RACE  TOTCHG  APRDRG  0  1
0     17       1    2   1.0    2660     560  0  1
1     17       0    2   1.0    1689     753  1  0
2     17       1    7   1.0   20060     930  0  1
3     17       1    1   1.0     736     758  0  1
4     17       1    1   1.0    1194     754  0  1
..   ...     ...  ...   ...     ...     ... .. ..
495    0       1    6   1.0    5881     636  0  1
496    0       1    2   1.0    1171     640  0  1
497    0       1    2   1.0    1171     640  0  1
498    0       1    2   1.0    1086     640  0  1
499    0       0    4   1.0    4931     640  1  0

[500 rows x 8 columns]

In [7]:
df = df.merge(dummy, left_index=True, right_index=True)
print(df)

     AGE  GENDER  LOS  RACE  TOTCHG  APRDRG  0_x  1_x  0_y  1_y
0     17       1    2   1.0    2660     560    0    1    0    1
1     17       0    2   1.0    1689     753    1    0    1    0
2     17       1    7   1.0   20060     930    0    1    0    1
3     17       1    1   1.0     736     758    0    1    0    1
4     17       1    1   1.0    1194     754    0    1    0    1
..   ...     ...  ...   ...     ...     ...  ...  ...  ...  ...
495    0       1    6   1.0    5881     636    0    1    0    1
496    0       1    2   1.0    1171     640    0    1    0    1
497    0       1    2   1.0    1171     640    0    1    0    1
498    0       1    2   1.0    1086     640    0    1    0    1
499    0       0    4   1.0    4931     640    1    0    1    0

[500 rows x 10 columns]